{
    "Loading": "Загрузка",
    "Close": "Закрыть",
    "Confirm": "Подтвердить",
    "Cancel": "Отмена",
    "Next": "Далее",
    "Finish": "Завершить",
    "Preparing connection settings": "Подготовка настроек соединения",
    "Establishing connection": "Установка соединения",
    "Initiate": "Инициировать",
    "Answer": "Ответить",
    "Proceed": "Продолжить",
    "Copy the code": "Скопировать код",
    "Broken code": "Неверный код",
    "Make new record": "Создать запись",
    "Choose type of record": "Выберите тип записи",
    "Enter amount": "Введите сумму",
    "Choose fund": "Выберите фонд",
    "Choose tags": "Выберите теги",
    "Amount": "Сумма",
    "Select tag": "Выберите тег",
    "No more tags exist": "Больше нет тегов",
    "Recommended": "Рекомендуется",
    "of": "из",
    "today": "сегодня",
    "Income": "Доход",
    "Expense": "Расход",
    "Create tag": "Создать тег",
    "Selected tags": "Выбранные теги",
    "Funds": "Фонды",
    "Wallets": "Кошельки",
    "Calculate daily limit": "Рассчитать дневной лимит",
    "Capacity": "Вместимость",
    "Cumulative": "Накопительный",
    "Delete this fund": "Удалить этот фонд",
    "Initial Balance": "Начальный баланс",
    "Name": "Имя",
    "optional": "необязательно",
    "Settings": "Настройки",
    "Submit": "Отправить",
    "Take deficit from wallet": "Взять дефицит из кошелька",
    "Calculate": "Рассчитать",
    "Export": "Экспорт",
    "Import": "Импорт",
    "Save": "Сохранить",
    "Connect to peer": "Подключиться к пиру",
    "Delete": "Удалить",
    "Your peers": "Ваши пиры",
    "You have no any peers yet": "У вас еще нет пиров",
    "Add fund": "Добавить фонд",
    "No funds created yet": "Фонды еще не созданы",
    "Distribute": "Распределить",
    "Reprioritize": "Изменить приоритеты",
    "Data successfully exported": "Данные успешно экспортированы",
    "Data successfully imported": "Данные успешно импортированы",
    "User successfully updated": "Пользователь успешно обновлен",
    "How much money do you have on your bank account right now?": "Сколько денег у вас сейчас на банковском счете?",
    "Bank account balance must be a positive number or 0": "Баланс банковского счета должен быть положительным числом или 0",
    "What's your regular monthly income?": "Каков ваш регулярный ежемесячный доход?",
    "Regular monthly income must be a positive number or 0": "Регулярный ежемесячный доход должен быть положительным числом или 0",
    "How much do you pay for rent monthly?": "Сколько вы платите за аренду ежемесячно?",
    "Monthly rent must be a positive number or 0": "Ежемесячная аренда должна быть положительным числом или 0",
    "How much do you pay for water monthly?": "Сколько вы платите за воду ежемесячно?",
    "Monthly water bill must be a positive number or 0": "Ежемесячный счет за воду должен быть положительным числом или 0",
    "How much do you pay for gas monthly?": "Сколько вы платите за газ ежемесячно?",
    "Monthly gas bill must be a positive number or 0": "Ежемесячный счет за газ должен быть положительным числом или 0",
    "How much do you pay for electricity monthly?": "Сколько вы платите за электричество ежемесячно?",
    "Monthly electricity bill must be a positive number or 0": "Ежемесячный счет за электричество должен быть положительным числом или 0",
    "How much do you spend on other necessary home fees monthly?": "Сколько вы тратите на другие необходимые домашние расходы ежемесячно?",
    "Other monthly home fees must be a positive number or 0": "Другие ежемесячные домашние расходы должны быть положительным числом или 0",
    "How much do you spend for transport monthly?": "Сколько вы тратите на транспорт ежемесячно?",
    "Monthly transport spendings must be a positive number or 0": "Ежемесячные транспортные расходы должны быть положительным числом или 0",
    "How much do you spend for mobile services monthly?": "Сколько вы тратите на мобильные услуги ежемесячно?",
    "Monthly mobile spendings must be a positive number or 0": "Ежемесячные расходы на мобильные услуги должны быть положительным числом или 0",
    "How much do you spend for internet services monthly?": "Сколько вы тратите на интернет ежемесячно?",
    "Monthly internet spendings must be a positive number or 0": "Ежемесячные расходы на интернет должны быть положительным числом или 0",
    "How much do you spend for loans monthly?": "Сколько вы тратите на кредиты ежемесячно?",
    "Monthly loan payments must be a positive number or 0": "Ежемесячные выплаты по кредитам должны быть положительным числом или 0",
    "How much do you spend for food and groceries monthly?": "Сколько вы тратите на еду и продукты ежемесячно?",
    "Monthly food spendings must be a positive number or 0": "Ежемесячные расходы на еду должны быть положительным числом или 0",
    "How much do you spend for pet supplies monthly?": "Сколько вы тратите на товары для животных ежемесячно?",
    "Monthly pet spendings must be a positive number or 0": "Ежемесячные расходы на животных должны быть положительным числом или 0",
    "How much do you spend for personal care monthly?": "Сколько вы тратите на личный уход ежемесячно?",
    "Monthly personal care spendings must be a positive number or 0": "Ежемесячные расходы на личный уход должны быть положительным числом или 0",
    "How much do you spend for household supplies monthly?": "Сколько вы тратите на хозяйственные товары ежемесячно?",
    "Monthly household supplies spendings must be a positive number or 0": "Ежемесячные расходы на хозяйственные товары должны быть положительным числом или 0",
    "How much do you spend for entertainment subscriptions monthly?": "Сколько вы тратите на развлекательные подписки ежемесячно?",
    "Monthly entertainment subscriptions must be a positive number or 0": "Ежемесячные расходы на развлекательные подписки должны быть положительным числом или 0",
    "How much do you spend for sports subscriptions monthly?": "Сколько вы тратите на спортивные подписки ежемесячно?",
    "Monthly sports subscriptions must be a positive number or 0": "Ежемесячные расходы на спортивные подписки должны быть положительным числом или 0",
    "How much do you spend for dining out monthly?": "Сколько вы тратите на питание вне дома ежемесячно?",
    "Monthly dining out spendings must be a positive number or 0": "Ежемесячные расходы на питание вне дома должны быть положительным числом или 0",
    "How much do you spend for entertainment monthly?": "Сколько вы тратите на развлечения ежемесячно?",
    "Monthly entertainment spendings must be a positive number or 0": "Ежемесячные расходы на развлечения должны быть положительным числом или 0",
    "How much do you spend for travel monthly?": "Сколько вы тратите на путешествия ежемесячно?",
    "Monthly travel spendings must be a positive number or 0": "Ежемесячные расходы на путешествия должны быть положительным числом или 0",
    "How much have you spent for rent in this month?": "Сколько вы потратили на аренду в этом месяце?",
    "Rent spendings must be a positive number or 0": "Расходы на аренду должны быть положительным числом или 0",
    "How much have you spent for water in this month?": "Сколько вы потратили на воду в этом месяце?",
    "Water spendings must be a positive number or 0": "Расходы на воду должны быть положительным числом или 0",
    "How much have you spent for gas in this month?": "Сколько вы потратили на газ в этом месяце?",
    "Gas spendings must be a positive number or 0": "Расходы на газ должны быть положительным числом или 0",
    "How much have you spent for electricity in this month?": "Сколько вы потратили на электричество в этом месяце?",
    "Electricity spendings must be a positive number or 0": "Расходы на электричество должны быть положительным числом или 0",
    "How much have you spent for other home fees in this month?": "Сколько вы потратили на другие домашние расходы в этом месяце?",
    "Home fees must be a positive number or 0": "Домашние расходы должны быть положительным числом или 0",
    "How much have you spent for transport in this month?": "Сколько вы потратили на транспорт в этом месяце?",
    "Transport spendings must be a positive number or 0": "Расходы на транспорт должны быть положительным числом или 0",
    "How much have you spent for loans in this month?": "Сколько вы потратили на кредиты в этом месяце?",
    "Loan payments must be a positive number or 0": "Выплаты по кредитам должны быть положительным числом или 0",
    "How much have you spent for mobile services in this month?": "Сколько вы потратили на мобильные услуги в этом месяце?",
    "Mobile spendings must be a positive number or 0": "Расходы на мобильные услуги должны быть положительным числом или 0",
    "How much have you spent for internet services in this month?": "Сколько вы потратили на интернет в этом месяце?",
    "Internet spendings must be a positive number or 0": "Расходы на интернет должны быть положительным числом или 0",
    "The funds are sucessfully calculated. Open main screen to check": "Фонды успешно рассчитаны. Откройте главный экран для проверки",
    "You're income doesn't cover your spendings!": "Ваш доход не покрывает ваши расходы!",
    "Couldn't calculate budgets": "Не удалось рассчитать бюджеты",
    "Do you accept new resource from the peer?": "Принять новый ресурс от пира?",
    "You refused to accept shared resource": "Вы отказались принять общий ресурс",
    "You accepted shared resource": "Вы приняли общий ресурс",
    "The peer accepted your fund": "Пир принял ваш фонд",
    "The peer refused your fund": "Пир отказался от вашего фонда",
    "The peer accepted your wallet": "Пир принял ваш кошелек",
    "The peer refused your wallet": "Пир отказался от вашего кошелька",
    "Answerer didn't accepted invitation": "Отвечающий не принял приглашение",
    "Initiator didn't accepted invitation": "Инициатор не принял приглашение",
    "Do you accept user?": "Принять пользователя?",
    "wants to subscribe": "Пользователь хочет подписаться",
    "You refused to connect to the peer.": "Вы отказались подключиться к пиру.",
    "Connected": "Подключено",
    "User disconnected": "Пользователь отключился",
    "Coudn't update wallet": "Не удалось обновить кошелек",
    "Couldn't delete fund": "Не удалось удалить фонд",
    "From user with id:": "От пользователя с id:",
    "To user with id:": "Пользователю с id:",
    "Couldn't update funds balances": "Не удалось обновить балансы фондов",
    "Wallet": "Кошелек",
    "Fund": "Фонд",
    "Cost": "Расход",
    "User": "Пользователь",
    "Tag": "Тег",
    "SynchronizationOrder": "ПорядокСинхронизации",
    "Couldn't create a user": "Не удалось создать пользователя",
    "Couldn't create a wallet": "Не удалось создать кошелек",
    "Couldn't revert scenario. User wasn't created": "Не удалось отменить сценарий. Пользователь не был создан",
    "Couldn't add sharing rule": "Не удалось добавить правило совместного использования",
    "Couldn't delete sharing rule": "Не удалось удалить правило совместного использования"
}